Ran Plan for 2 projects:

1. dir: `vpc-demo-1` workspace: `default`
1. dir: `vpc-demo-2` workspace: `default`

### 1. dir: `vpc-demo-1` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_internet_gateway.gw will be updated in-place
~ resource "aws_internet_gateway" "gw" {
        id       = "igw-0ea97703b5cb2c598"
        tags     = {
            "Name" = "Project VPC IGW Demo1"
        }
      + vpc_id   = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_subnet.private_subnets[0] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0dacb30f6b09dfb0c" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.2.4.0/24" -> "10.1.4.0/24" # forces replacement
      ~ id                                             = "subnet-0dacb30f6b09dfb0c" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet-1"
        }
      ~ vpc_id                                         = "vpc-0d781d3576957f697" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_subnets[1] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-00960ef2a238b22b5" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.2.5.0/24" -> "10.1.5.0/24" # forces replacement
      ~ id                                             = "subnet-00960ef2a238b22b5" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet-2"
        }
      ~ vpc_id                                         = "vpc-0d781d3576957f697" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_subnets[2] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-09bbe94c7d8b9ff6c" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.2.6.0/24" -> "10.1.6.0/24" # forces replacement
      ~ id                                             = "subnet-09bbe94c7d8b9ff6c" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet-3"
        }
      ~ vpc_id                                         = "vpc-0d781d3576957f697" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[0] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0297b23353c11344e" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.2.1.0/24" -> "10.1.1.0/24" # forces replacement
      ~ id                                             = "subnet-0297b23353c11344e" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo1-1"
        }
      ~ vpc_id                                         = "vpc-0d781d3576957f697" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[1] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0bed15734077e8959" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.2.2.0/24" -> "10.1.2.0/24" # forces replacement
      ~ id                                             = "subnet-0bed15734077e8959" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo1-2"
        }
      ~ vpc_id                                         = "vpc-0d781d3576957f697" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[2] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0499b79418ea7e566" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.2.3.0/24" -> "10.1.3.0/24" # forces replacement
      ~ id                                             = "subnet-0499b79418ea7e566" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo1-3"
        }
      ~ vpc_id                                         = "vpc-0d781d3576957f697" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_vpc.main must be replaced
-/+ resource "aws_vpc" "main" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:630209571978:vpc/vpc-0d781d3576957f697" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.2.0.0/16" -> "10.1.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-034a793d3d061cb6e" -> (known after apply)
      ~ default_route_table_id               = "rtb-079b46d176584bf38" -> (known after apply)
      ~ default_security_group_id            = "sg-0e6721c6770a86d0d" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0d066b25db65ca600" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ enable_dns_hostnames                 = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-0d781d3576957f697" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-079b46d176584bf38" -> (known after apply)
      ~ owner_id                             = "630209571978" -> (known after apply)
        tags                                 = {
            "Name" = "Project VPC Demo1"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 7 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc-demo-1`
* :put_litter_in_its_place: To **delete** this plan click [here](https://180f-100-26-152-126.ngrok.io/lock?id=Pin-Cheng%252Faws-vpc%252Fvpc-demo-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc-demo-1`
</details>
Plan: 7 to add, 1 to change, 7 to destroy.

---
### 2. dir: `vpc-demo-2` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_internet_gateway.gw will be updated in-place
~ resource "aws_internet_gateway" "gw" {
        id       = "igw-01769dc1d2c0af5f3"
        tags     = {
            "Name" = "Project VPC IGW Demo2"
        }
      ~ vpc_id   = "vpc-06e903fdf1548b8e7" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_subnet.private_subnets[0] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-01644ec03d907eca1" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.3.4.0/24" -> "10.11.4.0/24" # forces replacement
      ~ id                                             = "subnet-01644ec03d907eca1" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet Demo2-1"
        }
      ~ vpc_id                                         = "vpc-06e903fdf1548b8e7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_subnets[1] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0ec3c38ce85f3e31c" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.3.5.0/24" -> "10.11.5.0/24" # forces replacement
      ~ id                                             = "subnet-0ec3c38ce85f3e31c" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet Demo2-2"
        }
      ~ vpc_id                                         = "vpc-06e903fdf1548b8e7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_subnets[2] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-01f44b80eb70eaf4b" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.3.6.0/24" -> "10.11.6.0/24" # forces replacement
      ~ id                                             = "subnet-01f44b80eb70eaf4b" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet Demo2-3"
        }
      ~ vpc_id                                         = "vpc-06e903fdf1548b8e7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[0] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0b532e68f8aaa48b1" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.3.1.0/24" -> "10.11.1.0/24" # forces replacement
      ~ id                                             = "subnet-0b532e68f8aaa48b1" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo2-1"
        }
      ~ vpc_id                                         = "vpc-06e903fdf1548b8e7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[1] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0c4403e5fbc294667" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.3.2.0/24" -> "10.11.2.0/24" # forces replacement
      ~ id                                             = "subnet-0c4403e5fbc294667" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo2-2"
        }
      ~ vpc_id                                         = "vpc-06e903fdf1548b8e7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[2] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0ed997433b785c6fa" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.3.3.0/24" -> "10.11.3.0/24" # forces replacement
      ~ id                                             = "subnet-0ed997433b785c6fa" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo2-3"
        }
      ~ vpc_id                                         = "vpc-06e903fdf1548b8e7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_vpc.main must be replaced
-/+ resource "aws_vpc" "main" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:630209571978:vpc/vpc-06e903fdf1548b8e7" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.3.0.0/16" -> "10.11.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-044e20bfd5cad7155" -> (known after apply)
      ~ default_route_table_id               = "rtb-04424e350c6412d10" -> (known after apply)
      ~ default_security_group_id            = "sg-0551c76cd79193fbc" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0d066b25db65ca600" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ enable_dns_hostnames                 = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-06e903fdf1548b8e7" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-04424e350c6412d10" -> (known after apply)
      ~ owner_id                             = "630209571978" -> (known after apply)
        tags                                 = {
            "Name" = "Project VPC Demo2"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 7 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc-demo-2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://180f-100-26-152-126.ngrok.io/lock?id=Pin-Cheng%252Faws-vpc%252Fvpc-demo-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc-demo-2`
</details>
Plan: 7 to add, 1 to change, 7 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`